remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/instance/efuse_misc_regs0.h
/**
 * \file
 *
 * \brief Instance description for EFUSE_MISC_REGS0
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_EFUSE_MISC_REGS0_INSTANCE_
#define _SAMB11_EFUSE_MISC_REGS0_INSTANCE_

/* ========== Register definition for EFUSE_MISC_REGS0 peripheral ========== */
#if (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))

#define REG_EFUSE_MISC_REGS0_EFUSE_GLOBAL_RESET (0x4000A000U) /**< (EFUSE_MISC_REGS0) Active Low Global Reset */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_CONTROL (0x4000A004U) /**< (EFUSE_MISC_REGS0) EFUSE 1 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_CONTROL (0x4000A008U) /**< (EFUSE_MISC_REGS0) EFUSE 2 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_CONTROL (0x4000A00CU) /**< (EFUSE_MISC_REGS0) EFUSE 3 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_CONTROL (0x4000A010U) /**< (EFUSE_MISC_REGS0) EFUSE 4 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_CONTROL (0x4000A014U) /**< (EFUSE_MISC_REGS0) EFUSE 5 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_CONTROL (0x4000A018U) /**< (EFUSE_MISC_REGS0) EFUSE 6 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_0 (0x4000A01CU) /**< (EFUSE_MISC_REGS0) EFUSE_1_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_1 (0x4000A020U) /**< (EFUSE_MISC_REGS0) EFUSE_1_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_2 (0x4000A024U) /**< (EFUSE_MISC_REGS0) EFUSE_1_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_3 (0x4000A028U) /**< (EFUSE_MISC_REGS0) EFUSE_1_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_0 (0x4000A02CU) /**< (EFUSE_MISC_REGS0) EFUSE_1_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_1 (0x4000A030U) /**< (EFUSE_MISC_REGS0) EFUSE_1_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_2 (0x4000A034U) /**< (EFUSE_MISC_REGS0) EFUSE_1_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_3 (0x4000A038U) /**< (EFUSE_MISC_REGS0) EFUSE_1_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_0 (0x4000A03CU) /**< (EFUSE_MISC_REGS0) EFUSE_2_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_1 (0x4000A040U) /**< (EFUSE_MISC_REGS0) EFUSE_2_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_2 (0x4000A044U) /**< (EFUSE_MISC_REGS0) EFUSE_2_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_3 (0x4000A048U) /**< (EFUSE_MISC_REGS0) EFUSE_2_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_0 (0x4000A04CU) /**< (EFUSE_MISC_REGS0) EFUSE_2_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_1 (0x4000A050U) /**< (EFUSE_MISC_REGS0) EFUSE_2_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_2 (0x4000A054U) /**< (EFUSE_MISC_REGS0) EFUSE_2_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_3 (0x4000A058U) /**< (EFUSE_MISC_REGS0) EFUSE_2_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_0 (0x4000A05CU) /**< (EFUSE_MISC_REGS0) EFUSE_3_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_1 (0x4000A060U) /**< (EFUSE_MISC_REGS0) EFUSE_3_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_2 (0x4000A064U) /**< (EFUSE_MISC_REGS0) EFUSE_3_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_3 (0x4000A068U) /**< (EFUSE_MISC_REGS0) EFUSE_3_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_0 (0x4000A06CU) /**< (EFUSE_MISC_REGS0) EFUSE_3_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_1 (0x4000A070U) /**< (EFUSE_MISC_REGS0) EFUSE_3_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_2 (0x4000A074U) /**< (EFUSE_MISC_REGS0) EFUSE_3_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_3 (0x4000A078U) /**< (EFUSE_MISC_REGS0) EFUSE_3_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_0 (0x4000A07CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_1 (0x4000A080U) /**< (EFUSE_MISC_REGS0) EFUSE_4_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_2 (0x4000A084U) /**< (EFUSE_MISC_REGS0) EFUSE_4_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_3 (0x4000A088U) /**< (EFUSE_MISC_REGS0) EFUSE_4_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_0 (0x4000A08CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_1 (0x4000A090U) /**< (EFUSE_MISC_REGS0) EFUSE_4_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_2 (0x4000A094U) /**< (EFUSE_MISC_REGS0) EFUSE_4_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_3 (0x4000A098U) /**< (EFUSE_MISC_REGS0) EFUSE_4_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_0 (0x4000A09CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_1 (0x4000A0A0U) /**< (EFUSE_MISC_REGS0) EFUSE_5_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_2 (0x4000A0A4U) /**< (EFUSE_MISC_REGS0) EFUSE_5_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_3 (0x4000A0A8U) /**< (EFUSE_MISC_REGS0) EFUSE_5_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_0 (0x4000A0ACU) /**< (EFUSE_MISC_REGS0) EFUSE_5_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_1 (0x4000A0B0U) /**< (EFUSE_MISC_REGS0) EFUSE_5_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_2 (0x4000A0B4U) /**< (EFUSE_MISC_REGS0) EFUSE_5_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_3 (0x4000A0B8U) /**< (EFUSE_MISC_REGS0) EFUSE_5_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_0 (0x4000A0BCU) /**< (EFUSE_MISC_REGS0) EFUSE_6_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_1 (0x4000A0C0U) /**< (EFUSE_MISC_REGS0) EFUSE_6_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_2 (0x4000A0C4U) /**< (EFUSE_MISC_REGS0) EFUSE_6_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_3 (0x4000A0C8U) /**< (EFUSE_MISC_REGS0) EFUSE_6_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_0 (0x4000A0CCU) /**< (EFUSE_MISC_REGS0) EFUSE_6_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_1 (0x4000A0D0U) /**< (EFUSE_MISC_REGS0) EFUSE_6_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_2 (0x4000A0D4U) /**< (EFUSE_MISC_REGS0) EFUSE_6_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_3 (0x4000A0D8U) /**< (EFUSE_MISC_REGS0) EFUSE_6_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_MISC_CTRL (0x4000A0DCU) /**< (EFUSE_MISC_REGS0) EFUSE 6 Control Register */

#else

#define REG_EFUSE_MISC_REGS0_EFUSE_GLOBAL_RESET (*(__IO uint8_t*)0x4000A000U) /**< (EFUSE_MISC_REGS0) Active Low Global Reset */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_CONTROL (*(__IO uint32_t*)0x4000A004U) /**< (EFUSE_MISC_REGS0) EFUSE 1 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_CONTROL (*(__IO uint32_t*)0x4000A008U) /**< (EFUSE_MISC_REGS0) EFUSE 2 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_CONTROL (*(__IO uint32_t*)0x4000A00CU) /**< (EFUSE_MISC_REGS0) EFUSE 3 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_CONTROL (*(__IO uint32_t*)0x4000A010U) /**< (EFUSE_MISC_REGS0) EFUSE 4 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_CONTROL (*(__IO uint32_t*)0x4000A014U) /**< (EFUSE_MISC_REGS0) EFUSE 5 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_CONTROL (*(__IO uint32_t*)0x4000A018U) /**< (EFUSE_MISC_REGS0) EFUSE 6 Control Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_0 (*(__IO uint32_t*)0x4000A01CU) /**< (EFUSE_MISC_REGS0) EFUSE_1_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_1 (*(__IO uint32_t*)0x4000A020U) /**< (EFUSE_MISC_REGS0) EFUSE_1_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_2 (*(__IO uint32_t*)0x4000A024U) /**< (EFUSE_MISC_REGS0) EFUSE_1_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_PROG_3 (*(__IO uint32_t*)0x4000A028U) /**< (EFUSE_MISC_REGS0) EFUSE_1_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_0 (*(__I  uint32_t*)0x4000A02CU) /**< (EFUSE_MISC_REGS0) EFUSE_1_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_1 (*(__I  uint32_t*)0x4000A030U) /**< (EFUSE_MISC_REGS0) EFUSE_1_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_2 (*(__I  uint32_t*)0x4000A034U) /**< (EFUSE_MISC_REGS0) EFUSE_1_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_1_STATUS_3 (*(__I  uint32_t*)0x4000A038U) /**< (EFUSE_MISC_REGS0) EFUSE_1_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_0 (*(__IO uint32_t*)0x4000A03CU) /**< (EFUSE_MISC_REGS0) EFUSE_2_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_1 (*(__IO uint32_t*)0x4000A040U) /**< (EFUSE_MISC_REGS0) EFUSE_2_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_2 (*(__IO uint32_t*)0x4000A044U) /**< (EFUSE_MISC_REGS0) EFUSE_2_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_PROG_3 (*(__IO uint32_t*)0x4000A048U) /**< (EFUSE_MISC_REGS0) EFUSE_2_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_0 (*(__I  uint32_t*)0x4000A04CU) /**< (EFUSE_MISC_REGS0) EFUSE_2_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_1 (*(__I  uint32_t*)0x4000A050U) /**< (EFUSE_MISC_REGS0) EFUSE_2_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_2 (*(__I  uint32_t*)0x4000A054U) /**< (EFUSE_MISC_REGS0) EFUSE_2_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_2_STATUS_3 (*(__I  uint32_t*)0x4000A058U) /**< (EFUSE_MISC_REGS0) EFUSE_2_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_0 (*(__IO uint32_t*)0x4000A05CU) /**< (EFUSE_MISC_REGS0) EFUSE_3_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_1 (*(__IO uint32_t*)0x4000A060U) /**< (EFUSE_MISC_REGS0) EFUSE_3_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_2 (*(__IO uint32_t*)0x4000A064U) /**< (EFUSE_MISC_REGS0) EFUSE_3_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_PROG_3 (*(__IO uint32_t*)0x4000A068U) /**< (EFUSE_MISC_REGS0) EFUSE_3_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_0 (*(__I  uint32_t*)0x4000A06CU) /**< (EFUSE_MISC_REGS0) EFUSE_3_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_1 (*(__I  uint32_t*)0x4000A070U) /**< (EFUSE_MISC_REGS0) EFUSE_3_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_2 (*(__I  uint32_t*)0x4000A074U) /**< (EFUSE_MISC_REGS0) EFUSE_3_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_3_STATUS_3 (*(__I  uint32_t*)0x4000A078U) /**< (EFUSE_MISC_REGS0) EFUSE_3_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_0 (*(__IO uint32_t*)0x4000A07CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_1 (*(__IO uint32_t*)0x4000A080U) /**< (EFUSE_MISC_REGS0) EFUSE_4_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_2 (*(__IO uint32_t*)0x4000A084U) /**< (EFUSE_MISC_REGS0) EFUSE_4_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_PROG_3 (*(__IO uint32_t*)0x4000A088U) /**< (EFUSE_MISC_REGS0) EFUSE_4_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_0 (*(__I  uint32_t*)0x4000A08CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_1 (*(__I  uint32_t*)0x4000A090U) /**< (EFUSE_MISC_REGS0) EFUSE_4_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_2 (*(__I  uint32_t*)0x4000A094U) /**< (EFUSE_MISC_REGS0) EFUSE_4_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_4_STATUS_3 (*(__I  uint32_t*)0x4000A098U) /**< (EFUSE_MISC_REGS0) EFUSE_4_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_0 (*(__IO uint32_t*)0x4000A09CU) /**< (EFUSE_MISC_REGS0) EFUSE_4_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_1 (*(__IO uint32_t*)0x4000A0A0U) /**< (EFUSE_MISC_REGS0) EFUSE_5_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_2 (*(__IO uint32_t*)0x4000A0A4U) /**< (EFUSE_MISC_REGS0) EFUSE_5_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_PROG_3 (*(__IO uint32_t*)0x4000A0A8U) /**< (EFUSE_MISC_REGS0) EFUSE_5_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_0 (*(__I  uint32_t*)0x4000A0ACU) /**< (EFUSE_MISC_REGS0) EFUSE_5_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_1 (*(__I  uint32_t*)0x4000A0B0U) /**< (EFUSE_MISC_REGS0) EFUSE_5_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_2 (*(__I  uint32_t*)0x4000A0B4U) /**< (EFUSE_MISC_REGS0) EFUSE_5_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_5_STATUS_3 (*(__I  uint32_t*)0x4000A0B8U) /**< (EFUSE_MISC_REGS0) EFUSE_5_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_0 (*(__IO uint32_t*)0x4000A0BCU) /**< (EFUSE_MISC_REGS0) EFUSE_6_0 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_1 (*(__IO uint32_t*)0x4000A0C0U) /**< (EFUSE_MISC_REGS0) EFUSE_6_1 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_2 (*(__IO uint32_t*)0x4000A0C4U) /**< (EFUSE_MISC_REGS0) EFUSE_6_2 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_PROG_3 (*(__IO uint32_t*)0x4000A0C8U) /**< (EFUSE_MISC_REGS0) EFUSE_6_3 Program Register */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_0 (*(__I  uint32_t*)0x4000A0CCU) /**< (EFUSE_MISC_REGS0) EFUSE_6_0 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_1 (*(__I  uint32_t*)0x4000A0D0U) /**< (EFUSE_MISC_REGS0) EFUSE_6_1 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_2 (*(__I  uint32_t*)0x4000A0D4U) /**< (EFUSE_MISC_REGS0) EFUSE_6_2 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_6_STATUS_3 (*(__I  uint32_t*)0x4000A0D8U) /**< (EFUSE_MISC_REGS0) EFUSE_6_3 Status */
#define REG_EFUSE_MISC_REGS0_EFUSE_MISC_CTRL (*(__I  uint8_t*)0x4000A0DCU) /**< (EFUSE_MISC_REGS0) EFUSE 6 Control Register */

#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _SAMB11_EFUSE_MISC_REGS0_INSTANCE_ */
